model {
  ssd {
    num_classes: 3
    image_resizer {
      fixed_shape_resizer {
        height: 640
        width: 640
      }
    }
    feature_extractor {
      type: "ssd_resnet50_v1_fpn_keras"
      depth_multiplier: 1.0
      min_depth: 16
      conv_hyperparams {
        regularizer {
          l2_regularizer {
            weight: 0.0004
          }
        }
        initializer {
          truncated_normal_initializer {
            mean: 0.0
            stddev: 0.03
          }
        }
        activation: RELU_6
        batch_norm {
          decay: 0.997
          scale: true
          epsilon: 0.001
        }
      }
      override_base_feature_extractor_hyperparams: true
      fpn {
        min_level: 3
        max_level: 7
      }
    }
    box_coder {
      faster_rcnn_box_coder {
        y_scale: 10.0
        x_scale: 10.0
        height_scale: 5.0
        width_scale: 5.0
      }
    }
    matcher {
      argmax_matcher {
        matched_threshold: 0.5
        unmatched_threshold: 0.5
        ignore_thresholds: false
        negatives_lower_than_unmatched: true
        force_match_for_each_row: true
        use_matmul_gather: true
      }
    }
    similarity_calculator {
      iou_similarity {
      }
    }
    box_predictor {
      weight_shared_convolutional_box_predictor {
        conv_hyperparams {
          regularizer {
            l2_regularizer {
              weight: 0.0004
            }
          }
          initializer {
            random_normal_initializer {
              mean: 0.0
              stddev: 0.01
            }
          }
          activation: RELU_6
          batch_norm {
            decay: 0.997
            scale: true
            epsilon: 0.001
          }
        }
        depth: 256
        num_layers_before_predictor: 4
        kernel_size: 3
        class_prediction_bias_init: -4.6
      }
    }
    anchor_generator {
      multiscale_anchor_generator {
        min_level: 3
        max_level: 7
        anchor_scale: 4.0
        aspect_ratios: 1.0
        aspect_ratios: 2.0
        aspect_ratios: 0.5
        scales_per_octave: 2
      }
    }
    post_processing {
      batch_non_max_suppression {
        score_threshold: 1e-08
        iou_threshold: 0.5
        max_detections_per_class: 100
        max_total_detections: 100
        use_static_shapes: false
      }
      score_converter: SIGMOID
    }
    normalize_loss_by_num_matches: true
    loss {
      localization_loss {
        weighted_smooth_l1 {
        }
      }
      classification_loss {
        weighted_sigmoid_focal {
          gamma: 2.0
          alpha: 0.25
        }
      }
      classification_weight: 1.0
      localization_weight: 1.0
    }
    encode_background_as_zeros: true
    normalize_loc_loss_by_codesize: true
    inplace_batchnorm_update: true
    freeze_batchnorm: false
  }
}
train_config {
  batch_size: 10
  data_augmentation_options {	
    random_rgb_to_gray {	
    probability: 0.1	
    }	
  }	
  data_augmentation_options {	
    random_adjust_brightness {	
    max_delta: 0.2	
    }	
  }	
  data_augmentation_options {	
    random_adjust_contrast {	
    min_delta: 0.8	
    max_delta: 1.25	
    }	
  }	
  data_augmentation_options {	
    random_distort_color {	
    color_ordering: 1	
    }	
  }
}
train_input_reader {
  label_map_path: "label_map.pbtxt"
  tf_record_input_reader {
    input_path: "/home/workspace/data/train/segment-11076364019363412893_1711_000_1731_000_with_camera_labels.tfrecord"
    input_path: "/home/workspace/data/train/segment-1146261869236413282_1680_000_1700_000_with_camera_labels.tfrecord"
    input_path: "/home/workspace/data/train/segment-11392401368700458296_1086_429_1106_429_with_camera_labels.tfrecord"
    input_path: "/home/workspace/data/train/segment-11971497357570544465_1200_000_1220_000_with_camera_labels.tfrecord"
    input_path: "/home/workspace/data/train/segment-11183906854663518829_2294_000_2314_000_with_camera_labels.tfrecord"
    input_path: "/home/workspace/data/train/segment-11847506886204460250_1640_000_1660_000_with_camera_labels.tfrecord"
    input_path: "/home/workspace/data/train/segment-11846396154240966170_3540_000_3560_000_with_camera_labels.tfrecord"
    input_path: "/home/workspace/data/train/segment-10075870402459732738_1060_000_1080_000_with_camera_labels.tfrecord"
    input_path: "/home/workspace/data/train/segment-10327752107000040525_1120_000_1140_000_with_camera_labels.tfrecord"
    input_path: "/home/workspace/data/train/segment-10596949720463106554_1933_530_1953_530_with_camera_labels.tfrecord"
    input_path: "/home/workspace/data/train/segment-11454085070345530663_1905_000_1925_000_with_camera_labels.tfrecord"
  }
}
eval_config {
  metrics_set: "coco_detection_metrics"
  use_moving_averages: false
}
eval_input_reader {
  label_map_path: "label_map.pbtxt"
  shuffle: false
  num_epochs: 1
  tf_record_input_reader {
    input_path: "/home/workspace/data/val/segment-11199484219241918646_2810_030_2830_030_with_camera_labels.tfrecord"
    input_path: "/home/workspace/data/val/segment-10500357041547037089_1474_800_1494_800_with_camera_labels.tfrecord"
    input_path: "/home/workspace/data/val/segment-11566385337103696871_5740_000_5760_000_with_camera_labels.tfrecord"
    input_path: "/home/workspace/data/val/segment-11126313430116606120_1439_990_1459_990_with_camera_labels.tfrecord"
    input_path: "/home/workspace/data/val/segment-11252086830380107152_1540_000_1560_000_with_camera_labels.tfrecord"
    input_path: "/home/workspace/data/val/segment-10094743350625019937_3420_000_3440_000_with_camera_labels.tfrecord"
    input_path: "/home/workspace/data/val/segment-10485926982439064520_4980_000_5000_000_with_camera_labels.tfrecord"
    input_path: "/home/workspace/data/val/segment-10498013744573185290_1240_000_1260_000_with_camera_labels.tfrecord"
    input_path: "/home/workspace/data/val/segment-12179768245749640056_5561_070_5581_070_with_camera_labels.tfrecord"
  }
}